/*******************************************************************************
****蓝旗嵌入式系统 STM8S105 EasyKit
****LENCHIMCU.TAOBAO.COM
****版本:V1.0
****日期:14-2-2014
****说明:主芯片STM8S105C4T6
********************************************************************************/
#include "include.h"

/*******************************************************************************
****函数名称:
****函数功能:初始化ADC
****版本:V1.0
****日期:14-2-2014
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/
void ADC_Init(void)
{
    ADC1_DeInit();//ADC相关寄存器恢复默认值
    //初始化ADC:单次转换/通道8/时钟分频/关闭事件/数据右对齐/使能施密特触发器
    ADC1_Init(ADC1_CONVERSIONMODE_SINGLE, ADC1_CHANNEL_0, ADC1_PRESSEL_FCPU_D2, ADC1_EXTTRIG_TIM, DISABLE, ADC1_ALIGN_RIGHT, ADC1_SCHMITTTRIG_CHANNEL0, ENABLE);
    ADC1_Cmd(ENABLE);//使能ADC
}
/******************* (C) COPYRIGHT 2014 LENCHIMCU.TAOBAO.COM ******************/