/*******************************************************************************
****蓝旗嵌入式系统 STM8S105 EasyKit
****LENCHIMCU.TAOBAO.COM
****版本:V1.0
****日期:14-2-2014
****说明:主芯片STM8S105C4T6
********************************************************************************/
#include "include.h"

/*******************************************************************************
****函数名称:
****函数功能:蜂鸣器初始化
****版本:V1.0
****日期:14-2-2014
****入口参数:beep_fre鸣叫频率
****出口参数:无
****说明:
********************************************************************************/
void Beep_Init(BEEP_Frequency_TypeDef beep_fre)
{
  BEEP_DeInit();//相关寄存器恢复默认值
  CLK_LSICmd(ENABLE);//使能LSI
  BEEP_LSICalibrationConfig(128000);//校准LSI，必须在BEEP关闭的情况下进行
  BEEP_Init(beep_fre);//初始化BEEP
}
/******************* (C) COPYRIGHT 2014 LENCHIMCU.TAOBAO.COM ******************/