/*******************************************************************************
****蓝旗嵌入式系统 STM8S105 EasyKit
****LENCHIMCU.TAOBAO.COM
****版本:V1.0
****日期:14-2-2014
****说明:主芯片STM8S105C4T6
********************************************************************************/
#include "include.h"



/*******************************************************************************
****函数名称:
****函数功能:IWDG初始化
****版本:V1.0
****日期:14-2-2014
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/
void IWDG_Init(void)
{
   
   IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);
   IWDG_SetPrescaler(IWDG_Prescaler_16);//预分频16,16M/16=1M
   IWDG_SetReload(200);//200/1000000
   IWDG_ReloadCounter();
   IWDG_Enable(); 
}
/*******************************************************************************
****函数名称:
****函数功能:IWDG判断复位状态
****版本:V1.0
****日期:14-2-2014
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/
void IWDG_RstStatus(void)
{
    FlagStatus IwdgFlag;
    IwdgFlag = RST_GetFlagStatus(RST_FLAG_IWDGF);
    if (IwdgFlag)
    {
	LED_On(LED3);
	RST_ClearFlag(RST_FLAG_IWDGF);	
    } 
}
/******************* (C) COPYRIGHT 2014 LENCHIMCU.TAOBAO.COM ******************/