/*******************************************************************************
****蓝旗嵌入式系统 STM8S105 EasyKit
****LENCHIMCU.TAOBAO.COM
****版本:V1.0
****日期:14-2-2014
****说明:主芯片STM8S105C4T6
********************************************************************************/
#include "include.h"



/*******************************************************************************
****函数名称:
****函数功能:初始化窗口看门狗
****版本:V1.0
****日期:14-2-2014
****入口参数:Count-8位计数值 WinCount-7位窗口寄存器值0x00-x7f
****出口参数:无
****说明:
********************************************************************************/
void WWDG_Ini(u8 Count,u8 WinCount)
{
    /* WWDG 配置 */
    /* WWDG的时钟是跟系统时钟的
  		Watchdog Window= Count step to 0x3F step
    	= (Count-0x3F) * 1 step
    	= 41 * 1 step
    	= 41 * (12288/2Mhz)
    	= 251.9ms
    */
    /* Non Allowed Window = (Count-WinCount) * 1 step
    = (104-0x97) * 1 step
    = 7 * 1 step 
    = 7 * (12288/2Mhz) 
    = 43.008ms 
    */
    /* 
     * 所以不能在 0.0ms to 43.008ms 这个时间段清计数器
     * 允许的时间段是：43.008ms to 251.9ms 
     */
    WWDG_Init(Count, WinCount);
}
/*******************************************************************************
****函数名称:
****函数功能:窗口看门狗状态
****版本:V1.0
****日期:14-2-2014
****入口参数:
****出口参数:无
****说明:
********************************************************************************/
void WWDG_RstStatus(void)
{
   FlagStatus fs;
   fs = RST_GetFlagStatus(RST_FLAG_WWDGF);
   if(fs== SET)
   {
     RST_ClearFlag(RST_FLAG_WWDGF);
     LED_On(LED1);
   }
   
}
/*******************************************************************************
****函数名称:
****函数功能:重新加载窗口看门狗计数器
****日期:14-2-2014
****入口参数:
****出口参数:无
****说明:
********************************************************************************/
void WWDG_ReloadCount(void)
{
    u8 CounterValue;
    CounterValue = (u8)(WWDG_GetCounter() & 0x7F);
	
    /* 
    * 判断是否小于所设置的窗口上限值 
    * 只有小于窗口上限值才能清零
    */
    if(CounterValue < WINDOW)
    {
	WWDG_SetCounter(COUNTERINIT);
    }
}
/******************* (C) COPYRIGHT 2014 LENCHIMCU.TAOBAO.COM ******************/