/*******************************************************************************
****蓝旗嵌入式系统 STM8S105 EasyKit
****LENCHIMCU.TAOBAO.COM
****版本:V1.0
****日期:14-2-2014
****说明:主芯片STM8S105C4T6
********************************************************************************/
#include "include.h"
/*******************************************************************************
****函数名称:
****函数功能:配置CCO输出
****版本:V1.0
****日期:14-2-2014
****入口参数:CCOSOURCE-CCO频率源
****出口参数:无
****说明:
********************************************************************************/
void CCO_Out(CLK_Output_TypeDef CCOSOURCE)
{
   CLK_CCOConfig(CCOSOURCE);//配置时钟输出的时钟源
   CLK_CCOCmd(ENABLE);      //使能时钟输出
}
/******************* (C) COPYRIGHT 2014 LENCHIMCU.TAOBAO.COM ******************/